/*Что нужно сделать
Напишите программу для банкомата.
Условие:
Однажды Вася подошёл к банкомату и захотел обналичить N рублей. 
В банкомате есть купюры достоинством 100, 200, 500, 1 000, 2 000 и 5 000 рублей. Банкомат хочет выдать Васе запрошенную сумму, обойдясь как можно меньшим числом купюр.
Напишите программу для банкомата, которая по заданному числу N: 
решает, сколько купюр каждого номинала нужно выдать (4 по 200, 1 по 1 000) для получения суммы ровно N рублей; 
либо говорит, что выдать ровно N рублей невозможно, например если N не делится на 100.
Учтите, что банкомат не может выдать за один раз более 150 000 рублей. 
При попытке запросить такую сумму должно быть выдано сообщение об ошибке. Например, 800 рублей нужно выдать как 1 по 500, 1 по 200 и ещё 1 по 100.
Советы и рекомендации
Используйте как деление, так и получение остатка от деления.
Постарайтесь выдать самый оптимальный набор купюр.
Помните, что банкомат не может выдать за один раз более 150 000 рублей*/

#include <iostream>

int main() {
    int n;
    int count5k = 0, count2k = 0, count1k = 0, count05k = 0, count02k = 0, count01k = 0;
    std::cout << "\nВведите желаемую сумму снятия днежных средств: "; std::cin >> n; 

    std::cout << "\nВыданы купюры следующего номинала на сумму " << n << " рублей:";
    if (n <= 150000) {
        if (n % 100 <= 0) {
            if (n >= 5000) {
                count5k = n / 5000;
                n -= count5k * 5000;
            } if (n >= 2000) {
                count2k = n / 2000;
                n -= count2k * 2000;
            } if (n >= 1000) {
                count1k = n / 1000;
                n -= count1k * 1000;
            } if (n >= 500) {
                count05k = n / 500;
                n -= count05k * 500;
            } if (n >= 200) {
                count02k = n / 200;
                n -= count02k * 200;
            } if (n >= 100) {
                count01k = n / 100;
                n -= count01k * 100;
            }

            
            if (count5k > 0) {
                std::cout << "\n5000: " << count5k;
            }
            if (count2k > 0) {
                std::cout << "\n2000: " << count2k;
            }
            if (count1k > 0) {
                std::cout << "\n1000: " << count1k;
            }
            if (count05k > 0) {
                std::cout << "\n500: " << count05k;
            }
            if (count02k > 0) {
                std::cout << "\n200: " << count02k;
            }
            if (count01k > 0) {
                std::cout << "\n100: " << count01k;
            }
        } else {
            std::cout << "Сумма должна быть кратна 100 рублей.";
        }
    } else {
        std::cout << "Банкомат не может выдать за один раз более 150 000 рублей";
    }
}