#include <iostream>

int main () {
    int a, b, c, d;
    std::cout << "\nВведите массу первого автомобиля"; std::cin >> a;
    std::cout << "\nВведите массу второго автомобиля"; std::cin >> b;
    std::cout << "\nВведите массу третьего автомобиля"; std::cin >> c;
    std::cout << "\nВведите массу четвертого автомобиля"; std::cin >> d;

    if (a > 1200 || b > 1200 || c > 1200 || d > 1200) {
            std::cout << "\nМасса одного из авто более 1200 кг.";
    } else {
        std::cout << "\nВсе чисто!";
    }
}